_posts/2013-05-22-gsites-with-python.html
---
layout: page
title: Using Python to Update Google Sites Pages
tagline: oh how I miss SSIs
categories: computers
---



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Why update Google Sites pages with Python?</a></li>
<li><a href="#sec-2">2 How to update Google Sites pages with Python</a>
<ul>
<li><a href="#sec-2-1">2.1 Installing GData</a></li>
<li><a href="#sec-2-2">2.2 Creating an API Project</a></li>
<li><a href="#sec-2-3">2.3 The Beginning of my Python program</a></li>
<li><a href="#sec-2-4">2.4 Authorization to edit pages</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Reading data from Google Sites</a></li>
<li><a href="#sec-4">4 Writing to a Google Sites Page</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Why update Google Sites pages with Python?</h2>
<div class="outline-text-2" id="text-1">

<p>  Many people ran their own local web servers since the dawn of the
  web, and took advantage of their ownership of those web servers by
  having programmatically updated web pages within their website.
  This was often done by automatically generated HTML pages,
  server-side includes, or local scripts run by the web server.
</p>
<p>
  Now, however, many people are more interested in using cloud-based
  services for web pages&mdash;they leave all of the operations to
  someone else, often they can scale better than a local webserver
  could be scaled, and they often have very friendly interfaces that
  allow for updates by people who are not fluent in HTML or other web
  technologies.  A common choice for web pages that are hosted on
  someone elses' webserver is using Google Sites.
</p>
<p>
  Google Sites are excellent for creating web pages with rich content
  (videos, images, text) and controlling access to that content.
  Local scripts or server-side includes are not permitted, but it is
  possible to programmatically update Google Sites pages.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">How to update Google Sites pages with Python</h2>
<div class="outline-text-2" id="text-2">

<p>  Google provides a library of tools called GData<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup> that allows
  computer programs to read data from and write data to many of the
  Google sites.  The GData libraries are available in several
  languages (for more information see
  <a href="https://developers.google.com/gdata/">https://developers.google.com/gdata/</a>), but the easiest for me to
  use was Python, even though I don't really know how to program in
  Python.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Installing GData</h3>
<div class="outline-text-3" id="text-2-1">

<p>   First, I got the GData Python client library from
   <a href="https://developers.google.com/gdata/">https://developers.google.com/gdata/</a> and installed it in my home
   directory by finding the <code>setup.py</code> in the GData distribution and
   typing the command:
</p>


<pre class="example">python setup.py --home=~/python/
</pre>

<p>
   I also ran the included tests to make sure it was all working.
</p>
<p>
   GData comes with everything you need to work programmatically with
   information at Google.
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Creating an API Project</h3>
<div class="outline-text-3" id="text-2-2">

<p>   In order for your Python program to talk to Google, you need to
   create an API Client ID, which you can do for free at
   <a href="https://code.google.com/apis/console">https://code.google.com/apis/console</a>.  An API Client ID will give
   you a <i>Client ID</i> and a <i>Client secret</i>, both of which you'll need
   in your Python program.
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">The Beginning of my Python program</h3>
<div class="outline-text-3" id="text-2-3">

<p>   To get started, I imported the Python libraries I knew I'd need.
   I learned about the required <code>gdata</code> libraries from the API
   documentation.
</p>



<pre class="example">import sys
import os
import time
# adjust the next line for your installation of gdata
sys.path.append('/Users/acaird/python/lib/python')
import atom.data
import gdata.sites.client
import gdata.sites.data
import gdata.gauth
</pre>



<p>
   This block of code imports the standard Python libraries <code>sys</code>, <code>os</code>,
   and <code>time</code>, and you'll see those used later (in the case of <code>sys</code>,
   not too much later).
</p>
<p>
   Next I use the <code>sys</code> library to tell Python where I installed the
   <code>gdata</code> library with the <code>sys.path.append</code> function.  You will
   almost certainly want to edit that.  You can also use the
   <code>PYTHONPATH</code> environment variable.
</p>
<p>
   Once the program can find the <code>gdata</code> libraries, I import the ones
   the documentation says I'll need.
</p>
<p>
   At this point, I have all of the tools I need.
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">Authorization to edit pages</h3>
<div class="outline-text-3" id="text-2-4">

<p>   The next block of source code handles the authorization of the
   program to make changes to a Google Sites page.  The authorization
   is done using OAuth, an open standard and one that is well
   supported in the GData library<sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup>.  The flow of the code is:
</p><ol>
<li>Set a location for cached credentials
</li>
<li>Try to open the file in that location
<ol>
<li>If the file can be opened, try to read a <code>gauth</code> token from
          the file
</li>
<li>If the file cannot be opened, set the token to <code>None</code>
</li>
</ol>

</li>
<li>If there isn't a token, talk to Google to get one
       This process will print out a URL to be followed for
       authorization and ask for a key from the authorization to be
       entered, then authorize the client (this program, via the
       variable <code>client</code>), then save the credentials.
</li>
<li>If there is a token, it is used to authorize the client
</li>
</ol>


<p>
In this case, the client secret isn't a secret.<sup><a class="footref" name="fnr-.3" href="#fn-.3">3</a></sup>  The
<code>user_agent</code> can be anything meaningful to you so you can look at the
logs and see when your Python program changed your web content and
when a person changed it.
</p>
<p>
You'll notice in this code block we create the variable <code>client</code>; in
that creation we also select the Google Site we want to edit, in this
case it is confusingly called the same as my name, <code>acaird</code>.  I
suspect, but don't know for sure, you could read the sites (as below)
and select from a list programmatically.  In my case I know the name
of the site I want to update, so I just typed it in.
</p>
<p>
The <code>scope</code> in the <code>gdata.gauth.OAuth2Token</code> function call is
specific for Google Sites.  For a list of other scopes, see
<a href="http://googlecodesamples.com/oauth_playground/">http://googlecodesamples.com/oauth_playground/</a>.
</p>
<p>
<b>WARNING</b> The file to which the token is written is important, it
should be protected or removed if you aren't certain it can be kept
safe.
</p>




<pre class="example">token_cache_path=os.environ['HOME']+'/.gdata-storage'
print "Token Cache: %s" % token_cache_path
try:
   with open(token_cache_path, 'r') as f:
       saved_blob_string=f.read()
       if saved_blob_string is not None:
           token = gdata.gauth.token_from_blob(saved_blob_string)
       else:
           token = None
except IOError:
    token = None

if token == None :
   print "Getting a new token."
   token = gdata.gauth.OAuth2Token( client_id=MyClientId,
                                    client_secret=MyClientSecret,
                                    scope='https://sites.google.com/feeds/',
                                    user_agent='acaird-acexample-v1')
   url = token.generate_authorize_url(redirect_uri='urn:ietf:wg:oauth:2.0:oob')
   print 'Please go to the URL below and authorize this '
   print 'application, then enter the code it gives you.'
   print '   %s' % url
   code = raw_input("Code: ")
   token.get_access_token(code)
   client = gdata.sites.client.SitesClient(source='acaird-acexample-v1', site='acaird')
   token.authorize(client)
   saved_blob_string = gdata.gauth.token_to_blob(token)
   f=open (token_cache_path, 'w')
   f.write(saved_blob_string)
else:
   print "Using a cached token from %s" % token_cache_path
   client = gdata.sites.client.SitesClient(source='acaird-acexample-v1', site='acaird')
   token.authorize(client)

f.close()
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Reading data from Google Sites</h2>
<div class="outline-text-2" id="text-3">





<pre class="example">feed = client.GetSiteFeed()
print 'Google Sites associated with your account: '
counter = 0
for entry in feed.entry:
  print '       %i   %s (%s)' % (counter,entry.title.text, entry.site_name.text)
  counter = counter + 1
print ' --- The End ---'
</pre>


<p>
   This section of code, when run on my account, produces this output:
</p>


<pre class="example">Google Sites associated with your account:
       0   acaird (acaird)
       1   CD Squared Project (umcdsquared)
       2   U-M GPR Project (umichgpr)
       3   ORCI Project Site (umorciprojectsite)
       4   UM Projects (umprojectstruthkos)
 --- The End ---
</pre>


<p>
Since we already selected the <code>acaird</code> Google Site when we
initialized <code>client</code>, we can start fetching content from it.
</p>
<p>
I'm not sure what most of the code below does, but at the end, <code>old</code>
contains the HTML of the first webpage in the <code>acaird</code> Google Site,
which was my goal.
</p>



<pre class="example">kind = 'webpage'
print 'Fetching only %s entries' % kind
uri = '%s?kind=%s' % (client.MakeContentFeedUri(), kind)
feed = client.GetContentFeed(uri=uri)

print "Fetching content feed of '%s'...\n" % client.site
feed = client.GetContentFeed()

uri = '%s?kind=%s' % (client.MakeContentFeedUri(),'webpage')
feed = client.GetContentFeed(uri=uri)

old=feed.entry[0]

</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Writing to a Google Sites Page</h2>
<div class="outline-text-2" id="text-4">


<p>
To make sure we're updating the web page, here's the current date and
time for later use, and comparison between the output on this screen
and what is in the web page.
</p>



<pre class="example">time = time.asctime()
print "Time: %s" % time
</pre>


<p>
Then I create some new HTML, stored in <code>old.content.html</code>, which I
could print out, but I've commented out that line.
</p>
<p>
Then I call <code>client.Update</code> with the <code>feed.entry</code> in <code>old</code> to update
the page.
</p>



<pre class="example">
old.content.html = '''
&lt;html:div xmlns:html="http://www.w3.org/1999/xhtml"&gt;
  &lt;html:table cellspacing="0" border="1"
              class="sites-layout-name-one-column sites-layout-hbox"&gt;
    &lt;html:tbody&gt;
      &lt;html:tr&gt;
        &lt;html:td class="sites-layout-tile sites-tile-name-content-1"&gt;
          &lt;html:div dir="ltr"&gt;&amp;#160;This is my web page.
                                    It was last updated on %s by &lt;kbd&gt;%s&lt;/kbd&gt;&lt;br /&gt;
          &lt;/html:div&gt;
        &lt;/html:td&gt;
      &lt;/html:tr&gt;
    &lt;/html:tbody&gt;
  &lt;/html:table&gt;
&lt;/html:div&gt;
''' % (time,sys.argv[0])
# print old.content.html

updated_entry = client.Update(old)
print 'Web page updated.'
</pre>





<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="http://en.wikipedia.org/wiki/GData">http://en.wikipedia.org/wiki/GData</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.2" href="#fnr-.2">2</a></sup> <a href="https://developers.google.com/api-client-library/python/guide/aaa_oauth">https://developers.google.com/api-client-library/python/guide/aaa_oauth</a>
is a good reference for using the Python library version of GData's
OAuth.
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.3" href="#fnr-.3">3</a></sup> According to
<a href="https://developers.google.com/accounts/docs/OAuth2#installed">https://developers.google.com/accounts/docs/OAuth2#installed</a> "The
client_id and client_secret obtained during registration are embedded
in the source code of your application. In this context, the
client_secret is obviously not treated as a secret."
</p>



</div>
</div>

</div>
</div>
